ezois_ka/oooezoiskaobmen.ИТБК_/src/Reports/ИТБК_МатериальныйОтчет/ИТБК_МатериальныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИТБК_МатериальныйОтчет</name>
  <attributes>
    <name>ФормироватьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладЦеха</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Report>

ezois_ka/oooezoiskaobmen.ИТБК_/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f53b3b31-9cd3-4a9b-b293-626b3a525d66">
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26caefe6-3e76-4d73-9387-208213b91b67">
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0eec1c7a-4e84-488a-a0de-5ddf74b27a9c">
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a52a5aca-aa86-429b-b461-dbd79e1dbe24">
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="955ac7a2-906a-4d2b-9be1-a41ee11cec54">
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/ВариантыПриемкиТоваров/ВариантыПриемкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4ac76022-5cb3-45b4-bcb8-f601c15cee32">
  <name>ВариантыПриемкиТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0b878554-7a73-4ff3-b553-ce461e6a2d76">
    <name>РазделенаПоЗаказамИНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6b652820-7672-43f5-a265-2bed82a309a6">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fd2d4467-c99a-4ae0-9d0c-18b83c88da0a">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86ff623a-1439-42bc-865c-6d1a6f2310ef">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="580adfdd-4e0f-429d-a6b6-26bbd1c484ae">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f53c0f1-28e1-4b6c-bf6d-4ee84e53f2e7">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10a2a881-90dd-4870-8eb9-000c950d1492">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="26328513-0f92-4abb-904d-718c2ef2aa09">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3491db36-de30-4c70-9c1d-304c1abd8fb3">
    <name>ИТБК_ТехническийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c0a0e1b-f781-4c8c-9a24-fa5518f2aa7f">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6cc3a6d7-54b4-4e21-af19-24297ed6494a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a24a1454-023d-4c52-b65c-48eac9aa6b26">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="21b8e74c-f65c-4b59-a0d4-e168eabaef8c">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="34c531b3-d683-4691-a293-adcc992ec3ee">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="115ce427-73c1-401f-8d6e-e80508af67aa">
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="eb4af144-56bd-4e6c-ac30-c633306e809d">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1ae461d2-2742-4d9b-8b81-f8964039a476">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="246724f8-07cd-46a1-81f4-7c61066288b2">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4d3feaaa-f31b-421d-9cd7-76a3de6c3552">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Reports/ИТБК_МатериальныйОтчет/ManagerModule.bsl
Функция ПолучитьВыпускПродукции(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СборкаИзКомплектующих) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
	|	ТоварыОрганизаций.Регистратор КАК ДокументСборки,
	|	СУММА(ТоварыОрганизаций.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.Активность
	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГотоваяПродукция
	|	И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрганизаций.Номенклатура,
	|	ТоварыОрганизаций.Регистратор");
	
	Запрос.УстановитьПараметр("ДатаНачала"           , ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"        , ДатаОкончания);
	Запрос.УстановитьПараметр("ГотоваяПродукция"     , ГотоваяПродукция);
	Запрос.УстановитьПараметр("СборкаИзКомплектующих", СборкаИзКомплектующих);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьВыпускПродукции()

Функция ТекстЗапросаРазблюдовкаПоСпецификациям()
	
	Возврат "ВЫБРАТЬ
	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Номенклатура,
	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество КАК Количество,
	        |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Комплектующее,
	        |	ВариантыКомплектацииНоменклатурыТовары.Количество КАК КоличествоКомплектующих,
	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВариантКомплектацииУказан
	        |ИЗ
	        |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	        |		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
	        |			И (ВариантыКомплектацииНоменклатуры.Основной)
	        |			И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
	        |ГДЕ
	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка В(&ВариантыКомплектации)";	
	
КонецФункции // ТекстЗапросаРазблюдовкаПоСпецификациям()

Функция ТекстЗапросаРазблюдовкаПоСериям()
	
	Возврат "ВЫБРАТЬ
	        |	ТЗСерииНоменклатуры.Номенклатура КАК Номенклатура,
	        |	ТЗСерииНоменклатуры.Серия КАК Серия
	        |ПОМЕСТИТЬ ВТСерииНоменклатуры
	        |ИЗ
	        |	&ТЗСерииНоменклатуры КАК ТЗСерииНоменклатуры
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Номенклатура,
	        |	Серия
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТоварыНаСкладах.Регистратор КАК Регистратор,
	        |	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	        |	ТоварыНаСкладах.Серия КАК Серия,
	        |	СУММА(ТоварыНаСкладах.ВНаличии) КАК Количество
	        |ПОМЕСТИТЬ ВТТоварыНаСкладах
	        |ИЗ
	        |	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСерииНоменклатуры КАК ВТСерииНоменклатуры
	        |		ПО (ТоварыНаСкладах.Активность)
	        |			И (ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	        |			И ТоварыНаСкладах.Номенклатура = ВТСерииНоменклатуры.Номенклатура
	        |			И ТоварыНаСкладах.Серия = ВТСерииНоменклатуры.Серия
	        |			И (ТоварыНаСкладах.Регистратор ССЫЛКА Документ.СборкаТоваров)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТоварыНаСкладах.Номенклатура,
	        |	ТоварыНаСкладах.Серия,
	        |	ТоварыНаСкладах.Регистратор
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Регистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТТоварыНаСкладах.Номенклатура КАК Номенклатура,
	        |	ВТТоварыНаСкладах.Серия КАК Серия,
	        |	СУММА(ВТТоварыНаСкладах.Количество) КАК Количество,
	        |	ТоварыНаСкладах.Номенклатура КАК Комплектующее,
	        |	ТоварыНаСкладах.Серия КАК СерияКомплектующего,
	        |	ВЫБОР
	        |		КОГДА ТоварыНаСкладах.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК СерияУказана,
	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВариантКомплектацииУказан,
	        |	СУММА(ТоварыНаСкладах.ВНаличии) КАК КоличествоКомплектующих
	        |ИЗ
	        |	ВТТоварыНаСкладах КАК ВТТоварыНаСкладах
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	        |			ПО ТоварыНаСкладах.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
	        |				И (ВариантыКомплектацииНоменклатуры.Основной)
	        |				И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
	        |		ПО (ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	        |			И ВТТоварыНаСкладах.Регистратор = ТоварыНаСкладах.Регистратор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТТоварыНаСкладах.Номенклатура,
	        |	ВТТоварыНаСкладах.Серия,
	        |	ТоварыНаСкладах.Номенклатура,
	        |	ТоварыНаСкладах.Серия,
	        |	ВЫБОР
	        |		КОГДА ТоварыНаСкладах.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ,
	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)),
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ";
 
	
КонецФункции // ТекстЗапросаРазблюдовкаПоСериям()

Функция ПолучитьЗатратыНаСборку(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыОрганизаций.Регистратор КАК Регистратор,
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТТоварыОрганизаций
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.Активность
	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
	|	И ТоварыОрганизаций.АналитикаРасходов.Родитель = &ГотоваяПродукция
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТоварыОрганизаций.Регистратор,
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.Активность
	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
	|	И ТоварыОрганизаций.КорАналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГотоваяПродукция
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТоварыОрганизаций.Регистратор,
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.Активность
	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
	|	И ТоварыОрганизаций.СтатьяРасходов = &СтатьяРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОбороты.Склад КАК Склад,
	|	ТоварыНаСкладахОбороты.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОбороты.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СерияУказана,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВариантКомплектацииУказан,
	|	ТоварыНаСкладахОбороты.Регистратор КАК ДокументСборки,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОбороты.Номенклатура.Родитель = &ГотоваяПродукция
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоГотоваяПродукция,
	|	СУММА(ТоварыНаСкладахОбороты.ВНаличииРасход) КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТТоварыОрганизаций.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ВТТоварыОрганизаций КАК ВТТоварыОрганизаций)) КАК ТоварыНаСкладахОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыОрганизаций КАК ВТТоварыОрганизаций
	|		ПО ТоварыНаСкладахОбороты.Номенклатура = ВТТоварыОрганизаций.Номенклатура
	|			И ТоварыНаСкладахОбороты.Регистратор = ВТТоварыОрганизаций.Регистратор
	|			И (ТоварыНаСкладахОбороты.ВНаличииРасход <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ТоварыНаСкладахОбороты.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
	|			И (ВариантыКомплектацииНоменклатуры.Основной)
	|			И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	ТоварыНаСкладахОбороты.Серия,
	|	ТоварыНаСкладахОбороты.Склад,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОбороты.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ТоварыНаСкладахОбороты.Регистратор,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОбороты.Номенклатура.Родитель = &ГотоваяПродукция
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ");
	
	Запрос.УстановитьПараметр("ДатаНачала"      , ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"   , ДатаОкончания);
	Запрос.УстановитьПараметр("ГотоваяПродукция", ГотоваяПродукция);
	Запрос.УстановитьПараметр("СтатьяРасходов"  , СтатьяРасходов);
	
	ТабЗатратыНаСборку = Запрос.Выполнить().Выгрузить();
	
	ЕстьУзлы = Истина;
	
	Пока ЕстьУзлы Цикл
		ЕстьУзлы = Ложь;
		
		///////////////////////////////
		// разблюдовка по спецификациям
		Запрос.Текст = ТекстЗапросаРазблюдовкаПоСпецификациям();
		
		ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ВариантКомплектацииУказан,ЭтоГотоваяПродукция", Ложь, Истина, Ложь));
		
		// Номенклатура,Склад,Серия,СерияУказана,ВариантКомплектации,ВариантКомплектацииУказан,ДокументСборки,ЭтоГотоваяПродукция,Количество
		Пока ТабЗатратыДляРазблюдовки.Количество() > 0 Цикл
			ВариантыКомплектации = ТабЗатратыНаСборку.ВыгрузитьКолонку("ВариантКомплектации");
			
			// запрос в цикле детектед, а куда деваться?
			Запрос.УстановитьПараметр("ВариантыКомплектации", ВариантыКомплектации);
			ТабСпецификацииНаСборку = Запрос.Выполнить().Выгрузить();
			
			Для Каждого СтрЗатратыДляРазблюдовки Из ТабЗатратыДляРазблюдовки Цикл
				ТекущаяСпецификация = ТабСпецификацииНаСборку.НайтиСтроки(Новый Структура("Номенклатура", СтрЗатратыДляРазблюдовки.Номенклатура));
				
				// добавляем разблюдовку узла в затраты и исключаем узел
				Для Каждого СтрТекущаяСпецификация Из ТекущаяСпецификация Цикл
					СтрЗатратыНаСборку = ТабЗатратыНаСборку.Добавить();
					СтрЗатратыНаСборку.Номенклатура              = СтрТекущаяСпецификация.Комплектующее;
					СтрЗатратыНаСборку.Склад                     = СтрЗатратыДляРазблюдовки.Склад;
					СтрЗатратыНаСборку.Серия                     = Справочники.СерииНоменклатуры.ПустаяСсылка();
					СтрЗатратыНаСборку.СерияУказана              = Ложь;
					СтрЗатратыНаСборку.ВариантКомплектации       = СтрТекущаяСпецификация.ВариантКомплектации;
					СтрЗатратыНаСборку.ВариантКомплектацииУказан = СтрТекущаяСпецификация.ВариантКомплектацииУказан;
					СтрЗатратыНаСборку.ДокументСборки            = СтрЗатратыДляРазблюдовки.ДокументСборки;
					СтрЗатратыНаСборку.ЭтоГотоваяПродукция       = Ложь;
					СтрЗатратыНаСборку.Количество                = СтрЗатратыДляРазблюдовки.Количество * СтрТекущаяСпецификация.КоличествоКомплектующих / СтрТекущаяСпецификация.Количество;
					
					ЕстьУзлы = Истина;
				КонецЦикла;
				
				ТабЗатратыНаСборку.Удалить(СтрЗатратыДляРазблюдовки);
			КонецЦикла;
			
			// разблюдовываем глубже
			ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ВариантКомплектацииУказан,ЭтоГотоваяПродукция", Ложь, Истина, Ложь));
		КонецЦикла;
		
		////////////////////////
		// разблюдовка по сериям
		Запрос.Текст = ТекстЗапросаРазблюдовкаПоСериям();
		
		ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь));
		
		// Номенклатура,Склад,Серия,СерияУказана,ВариантКомплектации,ВариантКомплектацииУказан,ДокументСборки,ЭтоГотоваяПродукция,Количество
		Пока ТабЗатратыДляРазблюдовки.Количество() > 0 Цикл
			ТабСерииНоменклатуры = ТабЗатратыНаСборку.Скопировать(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь), "Номенклатура,Серия");
			
			// эх...
			Запрос.УстановитьПараметр("ТЗСерииНоменклатуры", ТабСерииНоменклатуры);
			ТабСпецификацииНаСборку = Запрос.Выполнить().Выгрузить();
			
			Для Каждого СтрЗатратыДляРазблюдовки Из ТабЗатратыДляРазблюдовки Цикл
				ТекущаяСпецификация = ТабСпецификацииНаСборку.НайтиСтроки(Новый Структура("Номенклатура,Серия", СтрЗатратыДляРазблюдовки.Номенклатура, СтрЗатратыДляРазблюдовки.Серия));
				
				// добавляем разблюдовку узла в затраты и исключаем узел
				Для Каждого СтрТекущаяСпецификация Из ТекущаяСпецификация Цикл
					СтрЗатратыНаСборку = ТабЗатратыНаСборку.Добавить();
					СтрЗатратыНаСборку.Номенклатура              = СтрТекущаяСпецификация.Комплектующее;
					СтрЗатратыНаСборку.Склад                     = СтрЗатратыДляРазблюдовки.Склад;
					СтрЗатратыНаСборку.Серия                     = СтрТекущаяСпецификация.СерияКомплектующего;
					СтрЗатратыНаСборку.СерияУказана              = СтрТекущаяСпецификация.СерияУказана;
					СтрЗатратыНаСборку.ВариантКомплектации       = СтрТекущаяСпецификация.ВариантКомплектации;
					СтрЗатратыНаСборку.ВариантКомплектацииУказан = СтрТекущаяСпецификация.ВариантКомплектацииУказан;
					СтрЗатратыНаСборку.ДокументСборки            = СтрЗатратыДляРазблюдовки.ДокументСборки;
					СтрЗатратыНаСборку.ЭтоГотоваяПродукция       = Ложь;
					СтрЗатратыНаСборку.Количество                = СтрЗатратыДляРазблюдовки.Количество * СтрТекущаяСпецификация.КоличествоКомплектующих / СтрТекущаяСпецификация.Количество;
					
					ЕстьУзлы = Истина;
				КонецЦикла;
				
				ТабЗатратыНаСборку.Удалить(СтрЗатратыДляРазблюдовки);
			КонецЦикла;
			
			// разблюдовываем глубже
			ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь));
		КонецЦикла;
	КонецЦикла; // Пока ЕстьУзлы Цикл
	
	ТабЗатратыНаСборку.Свернуть("Номенклатура,Склад, ДокументСборки", "Количество");
	
	Возврат ТабЗатратыНаСборку;
	
КонецФункции // ПолучитьЗатратыНаСборку()

Функция ПолучитьДокументПередачи(ДатаПередачи, ДатаФормирования, Организация, Склад, СкладЦеха, ТабТовары)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеПродукцииИМатериалов.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДопРеквизиты.Значение, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗаполнения
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.ДополнительныеРеквизиты КАК ДопРеквизиты
	|		ПО ДвижениеПродукцииИМатериалов.Ссылка = ДопРеквизиты.Ссылка
	|			И (ДопРеквизиты.Свойство = &РекДатаЗаполнения)
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую)
	|	И ДвижениеПродукцииИМатериалов.Организация = &Организация
	|	И ДвижениеПродукцииИМатериалов.Отправитель = &Склад
	|	И ДвижениеПродукцииИМатериалов.Получатель = &СкладЦеха
	|	И НЕ ДвижениеПродукцииИМатериалов.ПометкаУдаления
	|	И НЕ ДвижениеПродукцииИМатериалов.Проведен
	|	И ДвижениеПродукцииИМатериалов.Дата = &ДатаПередачи
	|	И ДвижениеПродукцииИМатериалов.ИТБК_ТехническийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗаполнения УБЫВ");
	
	РекДатаЗаполнения = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ПередачаВКладовую_ДатаЗаполненияМатОтчета");
	
	Запрос.УстановитьПараметр("ДатаПередачи"     , ДатаПередачи);
	Запрос.УстановитьПараметр("Склад"            , Склад);
	Запрос.УстановитьПараметр("СкладЦеха"        , СкладЦеха);
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("РекДатаЗаполнения", РекДатаЗаполнения);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ДокНайден = Ложь;
		
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ДокПередачи = Выборка.Ссылка.ПолучитьОбъект();
		
		// Сравниваем состав документа с отчетом
		СтараяТабТовары = ДокПередачи.Товары.Выгрузить(, "Номенклатура,Количество");
		СтараяТабТовары.Свернуть("Номенклатура", "Количество");
		СтараяТабТовары.Сортировать("Номенклатура", Новый СравнениеЗначений);
		
		НоваяТабТовары = ТабТовары.Скопировать();
		НоваяТабТовары.Свернуть("Номенклатура" , "Количество");
		НоваяТабТовары.Сортировать("Номенклатура" , Новый СравнениеЗначений);
		
		ЕстьРазница      = Ложь;
		СтарыйМаксИндекс = СтараяТабТовары.Количество() - 1;
		НовыйМаксИндекс  = НоваяТабТовары.Количество()  - 1;
		МаксИндекс       = Макс(СтарыйМаксИндекс, НовыйМаксИндекс);
				
		Для Индекс = 1 По МаксИндекс Цикл
			СтрСтарая = ?(Индекс > СтарыйМаксИндекс, Неопределено, СтараяТабТовары[Индекс]);
			СтрНовая  = ?(Индекс > НовыйМаксИндекс , Неопределено, НоваяТабТовары[Индекс]);
			
			Если СтрСтарая = Неопределено Или СтрНовая = Неопределено Или СтрСтарая.Номенклатура <> СтрНовая.Номенклатура Или СтрСтарая.Количество <> СтрНовая.Количество Тогда
				ЕстьРазница = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ДокНайден = Не ЕстьРазница;
	КонецЕсли;
	
	Если Не ДокНайден Тогда
		ДокПередачи = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
		ДокПередачи.ХозяйственнаяОперация    = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
		ДокПередачи.Организация              = Организация;
		ДокПередачи.Отправитель              = Склад;
		ДокПередачи.Получатель               = СкладЦеха;
		ДокПередачи.Дата                     = ДатаПередачи;
		ДокПередачи.ИТБК_ТехническийДокумент = Истина;
		ДокПередачи.ВариантПриемкиТоваров    = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		ДокПередачи.Комментарий              = "Интгерация мат.отчета в 1С Бух";
		ДокПередачи.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		Для Каждого СтрТовары Из ТабТовары Цикл
			НоваяСтрока = ДокПередачи.Товары.Добавить();
			НоваяСтрока.Номенклатура       = СтрТовары.Номенклатура;
			НоваяСтрока.Количество         = СтрТовары.Количество;
			НоваяСтрока.КоличествоУпаковок = СтрТовары.Количество;
		КонецЦикла;
		
		Если Не РекДатаЗаполнения.Пустая() Тогда
			СтрРеквизита = ДокПередачи.ДополнительныеРеквизиты.Найти(РекДатаЗаполнения, "Свойство");

			Если СтрРеквизита = Неопределено Тогда
				СтрРеквизита = ДокПередачи.ДополнительныеРеквизиты.Добавить();
				СтрРеквизита.Свойство = РекДатаЗаполнения;
			КонецЕсли;
			
			СтрРеквизита.Значение = ДатаФормирования;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокПередачи;
	
КонецФункции // ПолучитьДокументПередачи() 

Функция СформироватьДокументыПередачи(ДатаПередачи, Организация, СкладЦеха, ДеревоДанных, АдресФайлаОтчета) Экспорт
	
	ДатаФормирования = ТекущаяДатаСеанса(); 
	
  	ПараметрыФайлаОтчета = Новый Структура("Автор,ВладелецФайлов,ИмяБезРасширения,РасширениеБезТочки,ВремяИзмененияУниверсальное");
    ПараметрыФайлаОтчета.Автор              = ПараметрыСеанса.ТекущийПользователь;
	ПараметрыФайлаОтчета.ИмяБезРасширения   = "Материальный отчет " + Формат(ДатаФормирования, "ДФ=yyyy-MM-dd_HH-mm-ss");
	ПараметрыФайлаОтчета.РасширениеБезТочки = "mxl";
	
	ТабТовары = Новый ТаблицаЗначений;
	ТабТовары.Колонки.Добавить("Номенклатура");
	ТабТовары.Колонки.Добавить("Количество");
	
	ДокументыПередачи = Новый Массив;
	
	Для Каждого УзелСклад Из ДеревоДанных.Строки Цикл
		ТабТовары.Очистить();
		
		Для Каждого УзелНоменклатура Из УзелСклад.Строки Цикл
			СтрТовары = ТабТовары.Добавить();
			СтрТовары.Номенклатура = УзелНоменклатура.Номенклатура;
			СтрТовары.Количество   = УзелНоменклатура.Количество;
		КонецЦикла;
		
		ДокПередачи = ПолучитьДокументПередачи(ДатаПередачи, ДатаФормирования, Организация, УзелСклад.Склад, СкладЦеха, ТабТовары);
		
		// Согласованно сохраняем документ и прикрепляем файл отчета
		НачатьТранзакцию();
		
		Если ПустаяСтрока(ДокПередачи.Номер) Тогда
			ДокПередачи.УстановитьНовыйНомер();
		КонецЕсли;
		
		ДокПередачи.ДополнительныеСвойства.Вставить("ИТБК_ЗаполнениеМатОтчета", Истина);
		ДокПередачи.Записать(РежимЗаписиДокумента.Запись);
		
		ПараметрыФайлаОтчета.ВладелецФайлов = ДокПередачи.Ссылка;
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайлаОтчета, АдресФайлаОтчета);
		
		ЗафиксироватьТранзакцию();
		
		СтрСообщения = СтрШаблон("Создан (обновлен) документ %1", ДокПередачи);
		ОбщегоНазначения.СообщитьПользователю(СтрСообщения, ДокПередачи.Ссылка);
		
		ДокументыПередачи.Добавить(ДокПередачи.Ссылка);
	КонецЦикла;
	
	Возврат ДокументыПередачи;
	
КонецФункции // СформироватьДокументыПередачи()
